/*************************************************************************************************
Timer0.cpp
Файл включается в проект "Шлюз между сетью моноблоков и ModBus"
Содержит функции и данные для работы с TIMER0 для AtMEGA162
В данном проекте используется для формирования временных интервалов
для сети моноблоков
**************************************************************************************************/
#include "gate.h"
#include "timer0.h"
#include "MB_Net.h"
/**********************************************************************************************************
Инициализация таймера
***********************************************************************************************************/
__monitor void init_timer0(void)
{
    TCCR0=0x05;
    TCNT0=TIME_OUT;
    OCR0=0x00;
    TIMSK|=(1<<TOIE0);      
}
/**********************************************************************************************************
Прерывание от таймера 0
***********************************************************************************************************/
#pragma vector=TIMER0_OVF_vect
__interrupt void timer0_ovf_isr(void)
{
// Place your code here
    rx.counter=tx.counter=0;    // Сбросить счетчики передачи и приема
    TCCR0=0;                    // Остановить таймер
    if(net_flag & REQ_WIN)      // Если окно запроса
        {
        net_flag &=~REQ_WIN;
        build_command(MY_ADR,MARKER);
        }
    else                        // Если тайм-аут
        { 
        // Инициализируем UART
        UCSR1B=(char)((1<<RXCIE1)|(1<<RXEN1)|(1<<TXEN1)|(1<<UCSZ12));
        UCSR1C=(char)((1<<URSEL1)|(1<<UCSZ11)|(1<<UCSZ10));
        net_flag=0;
        contr_flag=0;
        net_member=0;
        m_counter=0;
        l_counter=0;
PORTC|=(1<<5);
        put_event(NOT_NET_ACCESS);        
        if((MY_ADR+1)<i_counter)
            {                       // Я первый
            adr_next=MY_ADR;
            i_counter=0;
            net_flag|=MARKER_MY|IN_NET;
            build_command(MY_ADR,MARKER);
            }
        else
            {                       // Ждем
            ++i_counter;
            /* Перезапустить тайм-аут */
            timer0_start(TIME_OUT);
            };
PORTC&=~(1<<5);
        };
}
// Timer/Counter 0 initialization
// Clock source: System Clock
// Clock value: 14,400 kHz
// Mode: Normal top=FFh
// OC0 output: Disconnected
/**********************************************************************************************************
Запуск таймера
***********************************************************************************************************/
__monitor void timer0_start(char value)
{
    TCCR0=0x05;
    TCNT0=value;
    OCR0=0x00;    
}
/**********************************************************************************************************
Остановка таймера
***********************************************************************************************************/
__monitor void timer0_stop(void)
{
    TCCR0=0x00;
    TCNT0=0x00;
    OCR0=0x00;    
}   
