/**********************************************************************************************************
Timer2.cpp
Файл включается в проект "Шлюз между сетью моноблоков и ModBus"
Содержит функции и данные для работы с TIMER2 для AtMEGA162
В данном впроекте используется для формирования необходимых временных интервалов
при передаче/приеме данных в/из систему/ы сбора данных по протоколу ModBus
***********************************************************************************************************/
#include "gate.h"
#include "timer2.h"
#include "modbus.h"

static struct // Данные таймера
    {
    bool complete;      // Признак окончания заданного временного интервала
    char counter,end;   // Текущее и конечное значение таймера
    } break_time;
/**********************************************************************************************************
Запуск таймера
***********************************************************************************************************/
__monitor void start_break(char break_value)   
{
    break_time.counter=0;
    break_time.end=break_value;
    break_time.complete=false;
    TCNT2=0;
    TIMSK|=(1<<OCIE2);
}
/**********************************************************************************************************
Если получен BREAK - истина
***********************************************************************************************************/
bool is_break_complete(void)            
{
    return break_time.complete;
}
/**********************************************************************************************************
Прерывание от таймера 2
***********************************************************************************************************/
#pragma vector=TIMER2_COMP_vect
__interrupt void isr_timer2_comp(void)
{
    if(++break_time.counter==break_time.end)
        {
        break_time.complete=true;       // Достигнуто значение BREAK
        TIMSK&=~(1<<OCIE2);             // Остановить таймер
        if(break_time.end==RX_BREAK)    // Если обнаружен BREAK для приема
            {
            put_event(MODBUS_RECEIVED); // Формируем событие "Посылка ModBus получена"
            };
        }
    else
        {
        TCNT2=0;
        };
}
