/**********************************************************************************************************
Timer1.cpp
Файл включается в проект "Шлюз между сетью моноблоков и ModBus"
Содержит функции и данные для работы с TIMER1 для AtMEGA162
В данном проекте используется для формирования тайм-аутов 
для автомата конечных состояний
***********************************************************************************************************/
#include "gate.h"
#include "timer1.h"

/**********************************************************************************************************
Запуск таймера
***********************************************************************************************************/
__monitor void start_timeout(unsigned short time)   
{
    TCCR1A=0x00;
    TCCR1B=0x0D;
    TCNT1=0x00;
    ICR1=0x00;
    OCR1A=time;
    OCR1B=0x00;
    TIMSK|=(1<<OCIE1A); 
}
/**********************************************************************************************************
Timer 1 output compare A interrupt service routine
***********************************************************************************************************/
#pragma vector=TIMER1_COMPA_vect 
__interrupt void timer1_compa_isr(void)
{
// Place your code here
PORTC|=(1<<4);
    TCCR1A=0x00;
    TCCR1B=0x00;
    TCNT1=0x00;
    ICR1=0x00;
    OCR1A=0x00;
    OCR1B=0x00;
    TIMSK&=~(1<<OCIE1A);
    put_event(TIMER_OVFL);      // Если достигло - формируем событие "Тайм аут"
PORTC&=~(1<<4);
}
