/**********************************************************************************************************
Uart0.cpp
Файл включается в проект "Шлюз между сетью моноблоков и ModBus"
Содержит функции и данные для работы с UART0 для AtMEGA162
В данном впроекте используется для передачи и приема данных
в/из систему/ы сбора данных по протоколу ModBus
***********************************************************************************************************/
#include "gate.h"
#include "UART0.h"
#include "timer2.h"

#define RXB8    1
#define TXB8    0
#define UPE     2
#define OVR     3
#define FE      4
#define TXEN    3 
#define RXEN    4
#define UDRIE   5
#define TXCIE   6
#define RXCIE   7

#define FRAMING_ERROR       (1<<FE)
#define PARITY_ERROR        (1<<UPE)
#define DATA_OVERRUN        (1<<OVR)

extern char modbus_buffer[MODBUS_BUFFER_SIZE];

__no_init static struct     // Буфер передатчика
    {
    char number;
    char *buffer;
    }tx_uart0;
__no_init static struct rx  // Буфер приемника
    {
    char counter;
    char *buffer;
    }rx_uart0;    
/**********************************************************************************************************
Инициализация UART0
***********************************************************************************************************/
__monitor void init_UART0(unsigned long baudrate)   
{
    unsigned short baud=(MCU_CLOCK/16/baudrate-1);
    UBRR0L= (char)baud;                           /* Set baud rate */
    UBRR0H= (char)(baud>>8);
    UCSR0A=0;
    UCSR0B= ((1<<RXEN0)|(1<<TXEN0));    // Разрешить прием, передачу 
    UCSR0C= ((1<<URSEL0)|(1<<UCSZ01)|(1<<UCSZ00)/*|(1<<USBS0)*/);  // Формат - 8 бит
}
/**********************************************************************************************************
Начать передачу через UART0
***********************************************************************************************************/
__monitor void send_uart0(char *out_data,char number) 
{
    tx_uart0.buffer=out_data;       // Установить буфер
    tx_uart0.number=number;         // Количество байт для передачи
    PORTB&=~(1<<PORTB0);            // Зажечь светодиод
    UCSR0A|=(1<<TXC0);              // Сбросить флаг окончания передачи
    UCSR0B|=(1<<TXCIE0);            // Разрешить прерывания по окончанию передачи
    UDR0=*tx_uart0.buffer;          // Первый байт из буфера в передатчик
}
/**********************************************************************************************************
Начать прием через UART0
***********************************************************************************************************/
__monitor void receive_uart0(char *pbuffer) 
{
        struct rx *prx=&rx_uart0;
        char tmp;
        
        prx->counter=0;             // Обнулить количество принятых байт
        prx->buffer=pbuffer;        // Установить буфер приемника
        tmp=UCSR0A;
        UCSR0A=0;
        tmp=UDR0;
        UCSR0B|=(1<<RXCIE0);        // Разрешить прерывания по приему
}
/**********************************************************************************************************
Возвращает количество принятых байт
***********************************************************************************************************/
char receive_counter_uart0(void)    
{
    return rx_uart0.counter;
}
/**********************************************************************************************************
Прерывание по окончании передачи байта
***********************************************************************************************************/
#pragma vector=USART0_TXC_vect
__interrupt void isr_USART0_TXC(void)
{
    //UCSR0A|=(1<<TXC0);
    if(--tx_uart0.number)           // Если передали не все
        UDR0=*(++tx_uart0.buffer);  // Передаем следующий байт
    else
        {                           // Если передали все
        UCSR0B&=~(1<<TXCIE0);       // Запретить прерывания
        PORTB|=(1<<PORTB0);         // Погасить светодиод
        put_event(MODBUS_SENDED);   // Формируем событие "Передача закончена"
        };
}
/**********************************************************************************************************
Прерывание по окончании приема байта
***********************************************************************************************************/
#pragma vector=USART0_RXC_vect
__interrupt void isr_USART0_RXC(void)
{
    struct rx *prx=&rx_uart0;
    char status=UCSR0A;             // Читаем регистр статуса
    char control=UCSR0B;
    char data=UDR0;                 // Читаем принятый байт

    if ((status & ((1<<FE0)|(1<<DOR0)|(1<<UPE0)))!=0) // Если аппаратный сбой приема    
        {
        return;                                       // на выход
        };
    if(prx->counter<MODBUS_BUFFER_SIZE)     // Пока буфер не переполнен
        {
        modbus_buffer[prx->counter++]=data;
        //*(prx->buffer+(prx->counter++))=data; // Принятый байт в буфер приемника
        start_break(RX_BREAK);              // Запускаем отсчет BREAK
        };
}
